# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.19-s055_1 on Sat Dec 13 21:57:46 -03 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design opdiv

create_clock -name "clock" -period 10.0 -waveform {0.0 5.0} [get_ports clock]
set_clock_transition 0.1 [get_clocks clock]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports nreset]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports nreset]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[31]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[30]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[29]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[28]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[27]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[26]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[25]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[24]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[23]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[22]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[21]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[20]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[19]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[18]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[17]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[16]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[15]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[14]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[13]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[12]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[11]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[10]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[9]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[8]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[7]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[6]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[5]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[4]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[3]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[2]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[1]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {a[0]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[31]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[30]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[29]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[28]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[27]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[26]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[25]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[24]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[23]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[22]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[21]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[20]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[19]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[18]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[17]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[16]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[15]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[14]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[13]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[12]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[11]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[10]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[9]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[8]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[7]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[6]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[5]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[4]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[3]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[2]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[1]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {b[0]}]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports in_valid_i]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports out_ready_i]
set_input_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports signal_division]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[31]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[30]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[29]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[28]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[27]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[26]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[25]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[24]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[23]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[22]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[21]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[20]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[19]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[18]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[17]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[16]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[15]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[14]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[13]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[12]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[11]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[10]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[9]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[8]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[7]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[6]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[5]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[4]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[3]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[2]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[1]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {a[0]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[31]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[30]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[29]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[28]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[27]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[26]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[25]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[24]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[23]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[22]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[21]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[20]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[19]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[18]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[17]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[16]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[15]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[14]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[13]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[12]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[11]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[10]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[9]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[8]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[7]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[6]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[5]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[4]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[3]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[2]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[1]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {b[0]}]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports in_valid_i]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports out_ready_i]
set_input_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports signal_division]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[31]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[30]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[29]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[28]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[27]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[26]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[25]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[24]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[23]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[22]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[21]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[20]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[19]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[18]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[17]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[16]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[15]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[14]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[13]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[12]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[11]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[10]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[9]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[8]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[7]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[6]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[5]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[4]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[3]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[2]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[1]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {c[0]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[31]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[30]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[29]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[28]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[27]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[26]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[25]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[24]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[23]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[22]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[21]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[20]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[19]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[18]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[17]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[16]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[15]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[14]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[13]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[12]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[11]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[10]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[9]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[8]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[7]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[6]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[5]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[4]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[3]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[2]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[1]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports {r[0]}]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports in_ready_o]
set_output_delay -clock [get_clocks clock] -add_delay -max 1.0 [get_ports out_valid_o]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[31]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[30]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[29]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[28]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[27]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[26]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[25]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[24]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[23]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[22]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[21]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[20]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[19]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[18]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[17]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[16]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[15]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[14]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[13]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[12]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[11]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[10]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[9]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[8]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[7]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[6]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[5]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[4]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[3]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[2]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[1]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {c[0]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[31]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[30]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[29]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[28]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[27]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[26]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[25]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[24]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[23]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[22]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[21]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[20]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[19]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[18]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[17]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[16]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[15]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[14]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[13]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[12]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[11]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[10]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[9]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[8]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[7]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[6]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[5]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[4]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[3]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[2]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[1]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports {r[0]}]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports in_ready_o]
set_output_delay -clock [get_clocks clock] -add_delay -min 0.3 [get_ports out_valid_o]
set_wire_load_mode "enclosed"
set_clock_uncertainty -setup 0.01 [get_clocks clock]
set_clock_uncertainty -hold 0.01 [get_clocks clock]
